app/Controllers/Auth.php

    public function loginProcess()
    {
        $recaptcha = $this->request->getPost('g-recaptcha-response');
        $secret = config('Recaptcha')->secretKey;
        $response = file_get_contents("https://www.google.com/recaptcha/api/siteverify?secret=$secret&response=$recaptcha");
        $responseKeys = json_decode($response, true);

        if (!$responseKeys["success"]) {
            return redirect()->back()->with('error', 'Captcha tidak valid.');
        }

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $userModel = new UserModel();
        $user = $userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'ayrani780@gmail.com'
 LIMIT 1