app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows` FROM `events`
SELECT COUNT(*) AS `numrows`
FROM `events`
WHERE `date` = '2026-09-16'
SELECT COUNT(*) AS `numrows`
FROM `events`
WHERE `date` < '2026-09-16'
SELECT *
FROM `users`
WHERE `users`.`id` = '23'
---
    public function index()
    {
        $role = session()->get('role');
        $userId = session()->get('user_id');

        $eventModel = new EventModel();
        $userModel = new UserModel();

        $today = date('Y-m-d');
        $totalAcara = $eventModel->countAll();

        $acaraBerlangsung = $eventModel->where('date', $today)->countAllResults();
        $eventModel = new EventModel(); // Reset builder
        $acaraSelesai = $eventModel->where('date <', $today)->countAllResults();

        // Ambil data user lengkap termasuk dinas
        $user = $userModel->find($userId);

SELECT *
FROM `users`
WHERE `users`.`id` = '23'
---
    public function profile()
    {
        $userId = session()->get('user_id');
        $role = session()->get('role');

        $userModel = new \App\Models\UserModel();
        $user = $userModel->find($userId);