app/Controllers/Event.php

    public function add()
    {
        if (!$this->checkAdminOrAdminDinas()) {
            return redirect()->to('/dashboard');
        }

        $eventModel = new EventModel();
        $data['events'] = $eventModel->findAll();
---
SELECT *
FROM `events`

    public function save()
    {
        if (!$this->checkAdminOrAdminDinas()) {
            return redirect()->to('/dashboard');
        }

        $eventModel = new EventModel();

        $name = $this->request->getPost('name');
        $date = $this->request->getPost('date');
        $time = $this->request->getPost('time');

        if (!$name || !$date || !$time) {
            return redirect()->to('/admin/event/add')->with('modal_type', 'invalid_input');
        }

        $existingEvent = $eventModel
            ->where('name', $name)
            ->where('date', $date)
            ->where('time', $time)
            ->first();
---
SELECT *
FROM `events`
WHERE `name` = 'Workshop'
AND `date` = '2026-09-17'
AND `time` = '09:00'
 LIMIT 1

            'created_by'      => session()->get('user_id'),
        ];

        $eventModel->save($eventData);
---
INSERT INTO `events` (`name`, `date`, `time`, `location`, `quota`, `quota_remaining`, `material_link`, `qr_code`, `created_by`) VALUES ('Workshop', '2026-09-17', '09:00', 'Jl. Ijen Nirwana Raya Blok A No. 16, Bareng, Kec. Klojen, Kota Malang', 9, 9, 'materi.pptx', 'event_6aaa49bc5c2c8', '23')

    public function list()
    {
        $eventModel = new EventModel();
        $userModel = new UserModel();

        $dinas = $this->request->getGet('dinas');

        $query = $eventModel
            ->select('events.*, users.dinas AS creator_name')
            ->join('users', 'users.id = events.created_by', 'left');

        if (!empty($dinas)) {
            $query->where('users.dinas', $dinas);
        }

        $events = $query->findAll();
---
SELECT `events`.*, `users`.`dinas` AS `creator_name`
FROM `events`
LEFT JOIN `users` ON `users`.`id` = `events`.`created_by`

    public function registerForm($eventId)
    {
        $eventModel = new EventModel();
        $data['event'] = $eventModel->find($eventId);
---
SELECT *
FROM `events`
WHERE `events`.`id` = '19'

    public function registerSubmit()
    {
        $registrationModel = new RegistrationModel();
        $eventModel = new EventModel();

        $eventId = $this->request->getPost('event_id');
        $userId = session()->get('user_id');

        $existingRegistration = $registrationModel->where('event_id', $eventId)
            ->where('user_id', $userId)
            ->first();

        if ($existingRegistration) {
            $data['error'] = 'Anda sudah terdaftar di acara ini.';
            $data['event'] = $eventModel->find($eventId);
            $data['user'] = [
                'full_name' => session()->get('full_name'),
                'nip' => session()->get('nip'),
                'phone' => session()->get('phone'),
                'institution' => session()->get('institution'),
                'position' => session()->get('position'),
                'dinas' => session()->get('dinas'),
            ];

            return view('event/register_event', $data);
        }

        $event = $eventModel->find($eventId);
---
SELECT *
FROM `events`
WHERE `events`.`id` = '19'

            ];

            $registrationModel->insert($data);
            $eventModel->update($eventId, [
                'quota_remaining' => $event['quota_remaining'] - 1
            ]);
---
UPDATE `events` SET `quota_remaining` = 8
WHERE `events`.`id` IN ('19')