app/Models/RegistrationModel.php

    public function getHistoryByUserId($userId)
    {
        return $this->select('event_registrations.id AS registration_id, event_registrations.*, events.name AS event_name, events.date AS event_date, events.time AS event_time, events.location AS event_location, events.material_link')
            ->join('events', 'events.id = event_registrations.event_id')
            ->where('event_registrations.user_id', $userId)
            ->orderBy('event_registrations.registered_at', 'DESC') // Tambahkan urutan descending supaya terbaru di atas
            ->findAll();
---
SELECT `event_registrations`.`id` AS `registration_id`, `event_registrations`.*, `events`.`name` AS `event_name`, `events`.`date` AS `event_date`, `events`.`time` AS `event_time`, `events`.`location` AS `event_location`, `events`.`material_link`
FROM `event_registrations`
JOIN `events` ON `events`.`id` = `event_registrations`.`event_id`
WHERE `event_registrations`.`user_id` = '22'
ORDER BY `event_registrations`.`registered_at` DESC